---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Number
source: html/cff842c6-97e2-7728-c1a5-3fd25bddf1a6.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Number Property

The number to identify the space.

## Syntax (C#)
```csharp
public string Number { get; }
```